# Drawing Conclusions Quiz
Use the space below to explore `store_data.csv` to answer the quiz questions below.

In [27]:
# imports and load data
import pandas as pd
df = pd.read_csv('store_data.csv')

In [34]:
# explore data
df.head()

         week  storeA  storeB  storeC  storeD  storeE
0  2014-05-04    2643    8257    3893    6231    1294
1  2014-05-11    6444    5736    5634    7092    2907
2  2014-05-18    9646    2552    4253    5447    4736
3  2014-05-25    5960   10740    8264    6063     949
4  2014-06-01    7412    7374    3208    3985    3023

In [29]:
# total sales for the last month
df.tail(1)

           week  storeA  storeB  storeC  storeD  storeE
199  2018-02-25    7560    6904    3569    5045    2585

In [30]:
# average sales
df.mean()

storeA    5865.480
storeB    6756.710
storeC    4942.105
storeD    5431.405
storeE    2580.025
dtype: float64

In [32]:
# sales on march 13, 2016
df.loc[df['week'] == '2016-03-13']

          week  storeA  storeB  storeC  storeD  storeE
97  2016-03-13    2054    1390    5112    5513    2536

In [33]:
# worst week for store C
min_val = df['storeC'].min()
df.loc[df['storeC'] == min_val]

         week  storeA  storeB  storeC  storeD  storeE
9  2014-07-06    8567    3228     927    3277     168

In [44]:
# total sales during most recent 3 month period
df.iloc[-3:].sum()

week      2018-02-112018-02-182018-02-25
storeA                             20274
storeB                             18092
storeC                             12260
storeD                             16827
storeE                              6329
dtype: object